module.exports = (robot) ->
    like = [
        'ｴﾍｯ///'
        '照れちゃうじゃないですか★'
        'ありがと///'
        'σ(*´∀｀照)えへへ'
        '（*ﾉﾉ)ｷｬｯ(*ﾉωﾉ)ｷｬｯ(*ﾉωﾟ)ゝﾁﾗｯ(*ﾉωﾉ)ｷｬｯ(*ﾉﾉ)ｷｬｯ'
        'もじ(´pq｀*)三(*´pq｀)もじ'
        'ﾎﾟｯﾎﾟｯo(*´ω`*)oﾎﾟｫ～'
        '(●ﾉωﾉ)ﾃﾚ'
    ]
    
    love =  [
        '(*ﾉωﾉ)ｷｬｰ'
        'ありがとうございます♪ワタシも・・ですよ///'
        '"`ｨ！ラブレター○o。|壁|〃∇〃)-o[＼／]'
        'そんなこと言われたらワタシも好きになっちゃいますよ///'
        '受け取れ!!(* ´皿`)┳・・・・・・*ﾄﾞｷｭーﾝ【愛】*｡◇｡)'
        '気持ﾁ受ヶ取ｯﾃ(*´∇｀*)_□←ﾁｮｺﾚｰﾄ'
        '｡o.ﾟ｡ぃ⊃も(｡-ω-人-ω-｡)ぁりヵゞとぅ｡o.ﾟ｡'
    ]
    
    pantsu = [
        'なに考えてんですかー'
        'ヾ(｀ω´*)ﾉ"ｹｼｶﾗﾝ'
        'ヽ(｀Д´#)ﾉ'
        '履いてますっ！'
    ]

    robot.respond /名前/i, (msg) ->
          msg.send 'かすみっていいます'

    robot.respond /(好き|すき)/i, (msg) ->
          msg.send msg.random like

    robot.respond /(大好き|だいすき|love|愛してる)/i, (msg) ->
          msg.send msg.random love

    robot.respond /(パンツ|ぱんつ)/i, (msg) ->
          msg.send msg.random pantsu
